docs/Vim/vertical-navigation-in-vim.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vertical Navigation in Vim</title>
<meta name="author" content="Vernon Grant" />
<meta name="description" content="Knowing how to effectively navigate code in a vertical direction can aid your pursuit of becoming more productive. Like most things, Vim provides us with an abundance of different ways to transverse our files vertically, and today we will be sharing some of our favorite ways to vertically navigate code inside of Vim." />
<meta name="keywords" content="Vim, Navigation, Key Bindings" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="https://www.vernon-grant.com/cropped-favicon-32x32.png" sizes="32x32" /><link rel="icon" href="https://www.vernon-grant.com/cropped-favicon-192x192.png" sizes="192x192" /><link rel="apple-touch-icon" href="https://www.vernon-grant.com/cropped-favicon-180x180.png" /><link rel="stylesheet" href="https://www.vernon-grant.com/stylesheet.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Vertical Navigation in Vim
<br>
<span class="subtitle">Effectively navigate code in a vertical direction can aid your pursuit of becoming more productive</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbe1ed76">Scrolling the window</a></li>
<li><a href="#org260a112">Relative line numbers</a></li>
<li><a href="#orgdb9e7c2">Making use of marks</a></li>
<li><a href="#org27716a2">Location lists</a></li>
<li><a href="#org94cff60">Common vertical motions</a></li>
</ul>
</div>
</div>
<p>
Knowing how to effectively navigate code in a vertical direction can aid your pursuit of becoming more productive. Like most things, Vim provides us with an abundance of different ways to transverse our files vertically, and today we will be sharing some of our favorite ways to vertically navigate code inside of Vim.
</p>

<div id="outline-container-orgbe1ed76" class="outline-2">
<h2 id="orgbe1ed76">Scrolling the window</h2>
<div class="outline-text-2" id="text-orgbe1ed76">
<p>
A common habit is to just hold down the j or k keys in order to scroll the active window, up or down. But there's a much faster and better way to move through a file, and that's by making use of the default key bindings <code>ctrl-u</code> and <code>ctrl-d</code>. As you might have guessed, the u stand for up, and the d stands for down.
</p>

<p>
One interesting advantage of using these bindings, instead of holding down <code>j</code> or <code>k</code> is that we get to move multiple lines at a time, and we can actually define how many lines we would like to move each time <code>ctrl-u</code> or <code>ctrl-d</code> is pressed, by setting the scroll option. By default, it will jump down half a screen.
</p>

<div class="org-src-container">
<pre class="src src-vim">set scroll=10 " Default, half a screen.
</pre>
</div>
</div>
</div>

<div id="outline-container-org260a112" class="outline-2">
<h2 id="org260a112">Relative line numbers</h2>
<div class="outline-text-2" id="text-org260a112">
<p>
Using relative line number can be a great way to accomplish vertical motions efficiently. You can set the relativenumber option inside your .vimrc to convert traditional line numbers to relative ones. Line numbers are relative to the current cursor line.
</p>

<div class="org-src-container">
<pre class="src src-vim">set relativenumber
</pre>
</div>

<p>
With relative line numbers enabled, you can prefix all vertical motions, such as j or k with a count. This gives you the power to jump a certain amount of lines without having to manually calculate it yourself.
</p>

<p>
For example, let's say I want to move the cursor 10 lines up. I know the point of interest is 10 lines above, because of the relative line numbers. I can then simply just type <code>10k</code> and the cursor will jump up 10 lines. This provides us with a lot of flexibility when motioning through the file.
</p>
</div>
</div>

<div id="outline-container-orgdb9e7c2" class="outline-2">
<h2 id="orgdb9e7c2">Making use of marks</h2>
<div class="outline-text-2" id="text-orgdb9e7c2">
<p>
Marks can be used to tie a cursor position, to a certain key on your keyboard, usually alphabetical letters are used. Not only does it store the location of the cursor, it can also remember the file when using uppercase letters for marks, making it extremely useful when working on multiple files.
</p>

<p>
Marks can make it easy to vertically navigate a file, as we can bookmark multiple working locations and quickly jump between them. We can set a new mark in normal mode by typing m followed by any alphabetical letter <code>{a-zA-Z}</code>. We can jump to a specific mark in two different ways:
</p>

<p>
The first method is with a backtick <code>`</code> followed by the mark's corresponding letter. This will place the cursor at the exact line and column that was originally marked.
</p>

<p>
The second method is with a single quote <code>'</code> followed by the mark's corresponding letter. This will place the cursor at the first non-blank character of the line that was marked.
</p>

<p>
Here's a quick example, let say we need to take a look at multiple function implementations at the bottom of our file, while working on some other function near the top. In this situation we have to jump vertically between 3 different locations. We can set the following marks:
</p>

<ul class="org-ul">
<li><code>mq</code> For the top position.</li>
<li><code>ma</code> For the first function implementation at the bottom of the file.</li>
<li><code>mz</code> For the second function implementation at the bottom of the file.</li>
</ul>

<p>
With our marks already set, we can jump between our 3 different locations using <code>'q</code>, <code>'a</code>, <code>'z</code>. There's additional ways we can jump between our defined marks, such as with <code>['</code> , which will jump to the mark before the cursor and <code>]'</code> which will jump the next mark below the cursor.
</p>

<p>
For more information about using marks, please see the vim's help section by typing.
</p>

<p>
<code>:help mark-motions</code>
</p>
</div>
</div>

<div id="outline-container-org27716a2" class="outline-2">
<h2 id="org27716a2">Location lists</h2>
<div class="outline-text-2" id="text-org27716a2">
<p>
A location list can be constructed that contains lines that matches a certain pattern. We can use any of the default location list grep commands to search the current file for a specific pattern, resulting in a neatly formatted list that we can use to vertically jump around the current file.
</p>

<div class="org-src-container">
<pre class="src src-shell">" Example of a location list for the pattern 'function'.
/blocks.php|23 col 1-9|  function register_block_type( $name, $args = array() ) {
/blocks.php|36 col 1-9|  function unregister_block_type( $name ) {
/blocks.php|48 col 1-9|  function remove_block_asset_path_prefix( $asset_handle_or_path ) {
/blocks.php|69 col 1-9|  function generate_block_asset_handle( $block_name, $field_name ) {
/blocks.php|101 col 1-9| function register_block_script_handle( $metadata, $field_name ) {
/blocks.php|156 col 1-9| function register_block_style_handle( $metadata, $field_name ) {
</pre>
</div>

<p>
For example: if we were inside a file that contained many different functions. It would be a great convenience if we could have a birds-eye view of all the functions inside of the file and jump between them. This can be done using the following grep command.
</p>

<ul class="org-ul">
<li><code>" lw</code> = Opens the location list.</li>
<li><code>" %</code>  = The current file.</li>
</ul>

<p>
<code>:lvimgrep /pattern/ % | lw</code>
</p>

<p>
After running the command, the location list will be populated with all the lines containing the pattern. If it was Python file for example, we would search for the word def to get the locations for each function in the file.
</p>

<p>
This gives us a handy tool that we can use to navigate the current file and gives us a great deal of contrast about the file we are working on.
</p>
</div>
</div>

<div id="outline-container-org94cff60" class="outline-2">
<h2 id="org94cff60">Common vertical motions</h2>
<div class="outline-text-2" id="text-org94cff60">
<p>
Before ending, here's some more general ways to motion or scroll vertically using some of the well-known Vim bindings.
</p>

<ul class="org-ul">
<li><code>H</code>, <code>M</code>, <code>L</code> can be used to move the cursor to the top, middle or bottom of the current window. H stands for home, M stands for middle and L stands for last.</li>
<li><code>zt</code>, <code>zz</code>, <code>zb</code> can be used to scroll the current line to the top, middle or bottom of the window, leaving the cursor in the same column.</li>
<li><code>gg</code>, <code>G</code> can be used to move the cursor to the start and end of a file. These commands are considered jumps, so you can return to your previous position using ctrl-o.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vernon Grant (<a href="mailto:info@vernon-grant.com">info@vernon-grant.com</a>)</p>
<p class="updated">Updated on: 2023-09-09 Sat 07:35</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
<p class="validation"></p>
</div>
</body>
</html>